brew "fish"                 # shell but rust
brew "neovim"          # vim but... NOT RUST???
brew "lsd"                     # ls but rust
brew "jj"                     # git but rust
brew "bat"                    # cat but rust
brew "hexyl"                  # xxd but rust
brew "ripgrep"               # grep but rust
brew "tokei"                 # cloc but rust
brew "helix"                  # vim but rust
brew "nushell"              # shell but rust
brew "uutils-coreutils" # coreutils but rust
brew "xh"                    # curl but rust
brew "starship"            # prompt but rust
brew "hyperfine"     # benchmarking but rust
brew "zoxide"                  # cd but rust
brew "just"                  # meke but rust
cask "espanso"      # text expander but rust
brew "bacon"              # fswatch but rust
brew "typst"                  # tex but rust
brew "fd"                    # find but rust
brew "bottom"                 # top but rust

brew "kondo" # cleanup build files
brew "http-server" # convenience utility
brew "periphery" # find unused swift code
brew "neofetch" # terminal info
brew "sl" # steam locomotive!
# TODO: rustup?
brew "pipx"
brew "swiftly"

# possible additions
# aria2
# ffmpeg
# imagemagick

### MARK: mac app store
brew "mas"

mas "Apple Developer", id: 640199958
mas "Auto HD + FPS for YouTube", id: 1546729687
mas "Focus (for YouTube)", id: 1514703160
mas "Ivory", id: 6444602274
mas "Noir", id: 1592917505
mas "Pixen", id: 525180431
mas "Telegram", id: 747648890
# mas "Unwatched", id: 6477287463 # disabled bc im using testflight version
mas "Userscripts", id: 1463298887
mas "Wipr 2", id: 1662217862

mas "Xcode", id: 497799835
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
# mas "Keynote", id: 409183694 # almost 800MB

### MARK: other apps
cask "blender"
cask "calibre"
cask "discord"
cask "ghidra"
cask "godot"
cask "netnewswire"
cask "obsidian"
cask "raycast"
cask "steam"
cask "textual"
cask "iina" # vlc but swift

